"Error: unable to download updates." = "錯誤：無法下載更新";
"Error: the downloaded file is corrupt." = "錯誤：下載檔案已損毀";
"Error: unable to open the downloaded file. Please try again." = "錯誤：無法開啟下載的更新檔案，請重試。";
"Error: %@ %@" = "錯誤： %@ %@";
"Download completes. Do you want to install it now?" = "下載已完成。您想要現在就安裝更新嗎？";
"Downloading...%d %%" = "下載中…%d %%";
"Downloading... %ju KB" = "下載中... %ju KB";
"A newer version is available." = "網路上已經有新版軟體可供下載";
"Do you want to download it right now?" = "請問您現在就要下載嗎？";
"Yes" = "是";
"No" = "否";
"Please download the newest version." = "建議您下載安裝最新版本的 Yahoo! 奇摩輸入法。";